ИС_СПОРТ_2022/src/Reports/ПодсчетРейтингов/ПодсчетРейтингов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ПодсчетРейтингов</name>
</mdclass:Report>

ИС_СПОРТ_2022/src/AccumulationRegisters/ПодсчетРейтингов/ПодсчетРейтингов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПодсчетРейтингов</name>
  <resources>
    <name>КоличествоБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Рейтинг</name>
    <type>
      <types>CatalogRef.Рейтинги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организатор</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Соревнование</name>
    <type>
      <types>CatalogRef.Соревнование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Спортсмен</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МеждународнаяВозрастнаяГруппа</name>
    <type>
      <types>CatalogRef.МеждународныеВозрастныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УчебныйГод</name>
    <type>
      <types>CatalogRef.УчебныйГод</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Команда</name>
    <type>
      <types>CatalogRef.Команды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Соревнование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.СпортивныеДисциплины</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ИС_СПОРТ_2022/src/Catalogs/Рейтинги/Рейтинги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Рейтинги</name>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРейтинга</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияРейтинга</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецРейтинга</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусРейтинга</name>
    <type>
      <types>EnumRef.Статусы</types>
    </type>
  </attributes>
  <attributes>
    <name>Организатор</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодсчетаРейтинга</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйСудья</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаместительГлавногоСудьи</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Секретарь</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавнаяЦель</name>
    <type>
      <types>CatalogRef.ЦелиПроведенияРейтинга</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СпонсорыРейтинга</name>
    <attributes>
      <name>Спонсор</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЦелиРейтинга</name>
    <attributes>
      <name>Цель</name>
      <type>
        <types>CatalogRef.ЦелиПроведенияРейтинга</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МеждународныеВозрастныеГруппы</name>
    <attributes>
      <name>МеждународнаяВозрастнаяГруппа</name>
      <type>
        <types>CatalogRef.МеждународныеВозрастныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>СистемаПодсчетаБаллов</name>
      <type>
        <types>CatalogRef.СистемаПодсчетаБаллов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ИС_СПОРТ_2022/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФамилияЛатиница</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяЛатиница</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтчествоЛатиница</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодРождения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПолисаОМС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ИС_СПОРТ_2022/src/Reports/ПодсчетРейтингов/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	
	СтандартнаяОбработка = Ложь; 

    НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	параметрРейтинг = НастройкиОтчета.ПараметрыДанных.Элементы.Найти("Рейтинг");
	Рейтинг = Справочники.Рейтинги.ПустаяСсылка();
	Если НЕ параметрРейтинг = Неопределено Тогда
		Рейтинг = параметрРейтинг.Значение;
	КонецЕсли;
	
	параметрПериод = НастройкиОтчета.ПараметрыДанных.Элементы.Найти("Период");
	Период = Дата(1,1,1);
	Если НЕ параметрПериод = Неопределено Тогда
		Период = параметрПериод.Значение;
	КонецЕсли;
	
	тзРезультат = Новый ТаблицаЗначений;
	тзРезультат.Колонки.Добавить("УчебныйГод"                    , Новый ОписаниеТипов("СправочникСсылка.УчебныйГод"));
	тзРезультат.Колонки.Добавить("Рейтинг"                       , Новый ОписаниеТипов("СправочникСсылка.Рейтинги"));
	тзРезультат.Колонки.Добавить("МеждународнаяВозрастнаяГруппа" , Новый ОписаниеТипов("СправочникСсылка.МеждународныеВозрастныеГруппы"));
	тзРезультат.Колонки.Добавить("Пол"                           , Новый ОписаниеТипов("ПеречислениеСсылка.ПолФизическогоЛица"));
	тзРезультат.Колонки.Добавить("Спортсмен"                     , Новый ОписаниеТипов("СправочникСсылка.Спортсмены"));
	тзРезультат.Колонки.Добавить("Соревнование"                  , Новый ОписаниеТипов("СправочникСсылка.Соревнование"));
	тзРезультат.Колонки.Добавить("КоличествоБаллов"              , Новый ОписаниеТипов("Число"));
	тзРезультат.Колонки.Добавить("МестоВРейтинге"                , Новый ОписаниеТипов("Число"));
	тзРезультат.Колонки.Добавить("Организатор"                   , Новый ОписаниеТипов("СправочникСсылка.Организации"));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период"  , Период);
	Запрос.УстановитьПараметр("Рейтинг" , Рейтинг);
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ПодсчетРейтингов.Рейтинг КАК Рейтинг,
	                |	ПодсчетРейтингов.УчебныйГод КАК УчебныйГод,
	                |	ПодсчетРейтингов.Организатор КАК Организатор,
					|	ПодсчетРейтингов.Соревнование КАК Соревнование,
	                |	ПодсчетРейтингов.Спортсмен КАК Спортсмен,
	                |	ФизическиеЛица.Пол КАК Пол,
	                |	ВЫБОР
	                |		КОГДА ФизическиеЛица.Пол = ЗНАЧЕНИЕ(перечисление.полфизическоголица.женский)
	                |			ТОГДА ""Девушки""
	                |		КОГДА ФизическиеЛица.Пол = ЗНАЧЕНИЕ(перечисление.полфизическоголица.мужской)
	                |			ТОГДА ""Юноши""
	                |		ИНАЧЕ """"
	                |	КОНЕЦ КАК ПолПредставление,
	                |	ПодсчетРейтингов.МеждународнаяВозрастнаяГруппа КАК МеждународнаяВозрастнаяГруппа,
	                |	СУММА(ПодсчетРейтингов.КоличествоБалловОстаток) КАК КоличествоБаллов
	                |ИЗ
	                |	РегистрНакопления.ПодсчетРейтингов.Остатки(&Период, Рейтинг = &Рейтинг) КАК ПодсчетРейтингов
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	                |		ПО ПодсчетРейтингов.Спортсмен.ФизическоеЛицо = ФизическиеЛица.Ссылка
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ПодсчетРейтингов.Рейтинг,
	                |	ПодсчетРейтингов.УчебныйГод,
	                |	ПодсчетРейтингов.Организатор,
					|	ПодсчетРейтингов.Соревнование,
	                |	ПодсчетРейтингов.Спортсмен,
	                |	ФизическиеЛица.Пол,
	                |	ВЫБОР
	                |		КОГДА ФизическиеЛица.Пол = ЗНАЧЕНИЕ(перечисление.полфизическоголица.женский)
	                |			ТОГДА ""Девушки""
	                |		КОГДА ФизическиеЛица.Пол = ЗНАЧЕНИЕ(перечисление.полфизическоголица.мужской)
	                |			ТОГДА ""Юноши""
	                |		ИНАЧЕ """"
	                |	КОНЕЦ,
	                |	ПодсчетРейтингов.МеждународнаяВозрастнаяГруппа
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	КоличествоБаллов УБЫВ
	                |ИТОГИ ПО
	                |	УчебныйГод,
	                |	Организатор,
	                |	МеждународнаяВозрастнаяГруппа,
	                |	Пол";
	
	//Если НЕ Рейтинг.Пол = Перечисления.ПолФизическогоЛица.ПустаяСсылка() Тогда
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%1", ", Пол");
	//Иначе
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%1", "");
	//КонецЕсли;
	
	ВыборкаУчебныйГод = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаУчебныйГод.Следующий() Цикл
		
		ВыборкаОрганизатор = ВыборкаУчебныйГод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаОрганизатор.Следующий() Цикл
			
			ВыборкаМеждународнаяВозрастнаяГруппа = ВыборкаОрганизатор.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаМеждународнаяВозрастнаяГруппа.Следующий() Цикл
				
				//Если НЕ Рейтинг.Пол = Перечисления.ПолФизическогоЛица.ПустаяСсылка() Тогда
					ВыборкаПол = ВыборкаМеждународнаяВозрастнаяГруппа.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаПол.Следующий() Цикл
						Выборка = ВыборкаПол.Выбрать();
						СформироватьТаблицуМестаПоРейтингу(тзРезультат,Выборка);
					КонецЦикла;	
				//Иначе
				//	Выборка = ВыборкаМеждународнаяВозрастнаяГруппа.Выбрать();
				//	СформироватьТаблицуМестаПоРейтингу(тзРезультат,Выборка); 
				//КонецЕсли;	
				
			КонецЦикла;	
			
		КонецЦикла;	
		
	КонецЦикла;	
	
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных; 
    МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки); 

    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных; 
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, Новый Структура("ТаблицаДанных", тзРезультат) , ДанныеРасшифровки, Истина); 
 
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент; 
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат); 
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
		
КонецПроцедуры

Процедура СформироватьТаблицуМестаПоРейтингу(тзРезультат,Выборка)
	
	МаксимальноеЗначение = 9999;
	Место                = 0;
	ПозицияМеста         = 1;
		
	Индекс = 0;
	Пока Выборка.Следующий() Цикл
		строкаРезультат = тзРезультат.Добавить();
		ЗаполнитьЗначенияСвойств(строкаРезультат,Выборка);
		Если Выборка.КоличествоБаллов < МаксимальноеЗначение Тогда
			МаксимальноеЗначение = Выборка.КоличествоБаллов;
			Место =  Индекс + 1;
			строкаРезультат.МестоВРейтинге = Место;
		Иначе
			строкаРезультат.МестоВРейтинге = Место;
		КонецЕсли;
		Индекс = Индекс + 1;
	КонецЦикла;
	
КонецПроцедуры
